<?php

return [
    'orders'    => [
        'index'         => [
            'alerts'    => [
                'order_failed'  => 'فشلت عملية الدفع حاول مره اخرى.',
                'order_success' => 'تم الدفع بنجاح',
                'payment_not_supported_now' => 'طريقة الدفع هذه غير مدعومة الآن, حاول مره اخرى لاحقا.',
                'order_done' => 'تم الطلب بنجاح',
                'your_order_will_be_delivered_on_time' => 'سيتم توصيل طلبك في الموعد المحدد',
                'this_state_is_not_supported' => 'التوصيل لهذه المنطقة غير متاح حاليا',
                'order_not_found' => 'هذا الطلب غير موجود!',
                'subscriptions_balance_insufficient' => 'عفوا, رصيد الإشتراك غير كاف لسداد قيمة الطلب',
                'cannot_update_order_in_case_of_is_ready' => 'لا يمكن التعديل على الطلب فى حالة التوصيل جاهز أو مكتمل',
                'insufficient_loyalty_points_balance' => 'رصيد نقاط الولاء غير كافٍ',
            ],
            'btn'       => [
                'details'   => 'تفاصيل الطلب',
            ],
            'title'     => 'طلباتي',
        ],
        'invoice'       => [
            'address'       => 'العنوان',
            'no_data'       => 'لا يوجد طلبات حاليا',
            'btn'           => [
                'print' => 'اطبع الفاتورة',
                'follow_order' => 'تتبع الطلب',
            ],
            'date'          => 'تاريخ الفاتورة',
            'order_date'    => 'تاريخ الشراء',
            'email'         => 'البريد',
            'method'        => 'طريقة الدفع',
            'cash'          => 'الدفع عند الإستلام',
            'online'        => 'الدفع فيزا / ماستر كارد / كي نت',
            'status'        => 'حالة الفاتورة',
            'mobile'        => 'رقم هاتف',
            'product_qty'   => 'الكمية',
            'product_title' => 'المنتج',
            'product_price' => 'السعر',
            'product_total' => 'المبلغ',
            'shipping'      => 'الشحن',
            'subtotal'      => 'المجموع',
            'title'         => 'فاتورة دفع',
            'details_title'         => 'تفاصيل الفاتورة',
            'total'         => 'المجموع الكلي',
            'username'      => 'الاسم',
            'order_id'      => 'رقم الفاتورة',
            'product_discount'     => 'الخصم',
            'client_address' => [
                'block'     => 'القطعه',
                'building'  => 'البنايه',
                'city'      => 'المحافظة',
                'data'      => 'بيانات عنوان التوصيل',
                'state'     => 'المنطقة',
                'street'    => 'الشارع',
                'details'   => 'تفاصيل العنوان',
                'civil_id'  => 'الرقم المدني',
                'mobile'    => 'الهاتف',
                'receiver'      => 'المرسل اليه',
                'sender'        => 'المرسل',
                'name'          => 'الاسم',
            ],
            'card'          =>  [
                'title'                 =>  'الكارت',
                'price'                 =>  'السعر',
                'sender_name'           =>  'اسم المرسل',
                'receiver_name'         =>  'اسم المرسل إليه',
                'message'               =>  'الرسالة',
            ],
            'addons'          =>  [
                'title'                 =>  'الإضافة',
                'price'                 =>  'السعر',
                'qty'                   =>  'الكمية',
            ],
            'gift'          =>  [
                'title'                 =>  'الهدية',
                'price'                 =>  'السعر',
                'products'              =>  'منتجات الهدية',
            ],
        ],
        'validations'   => [
            'address'   => [
                'min'       => 'من فضلك ادخل تفاصيل اكثر ، يجب الا يقل العنوان عن ١٠ احرف',
                'required'  => 'من فضلك ادخل تفاصيل الطلب',
                'string'    => 'من فضلك ادخل تفاصيل العنوان حروف و ارقام فقط',
            ],
            'block'     => [
                'required'  => 'من فضلك ادخل القطعة',
                'string'    => 'من فضلك ادخل القطعة ارقام و احرف فقط',
            ],
            'building'  => [
                'required'  => 'من فضلك ادخل البناية',
                'string'    => 'من فضلك ادخل البناية ارقام و احرف فقط',
            ],
            'email'     => [
                'email'     => 'من فضلك ادخل البريد الالكتروني بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'mobile'    => [
                'digits_between'    => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric'           => 'من فضلك ادخل رقم الموبيل ارقام انجليزية فقط',
                'required'          => 'من فضلك ادخل رقم الموبيل',
            ],
            'payment'   => [
                'required'  => 'من فضلك اختر طريقة الدفع',
                'in'        => 'طريقة الدفع يجب ان تكون ضمن',
            ],
            'state'     => [
                'numeric'   => 'من فضلك اختر المنطقة',
                'required'  => 'من فضلك اختر المنطقة',
            ],
            'street'    => [
                'required'  => 'من فضلك ادخل اسم / رقم الشارع',
                'string'    => 'من فضلك ادخل الشارع ارقام و احرف فقط',
            ],
            'username'  => [
                'min'       => 'من فضلك ادخل الاسم ولا يقل عن حرفين',
                'required'  => 'من فضلك ادخل الاسم',
                'string'    => 'من فضلك ادخل الاسم حروف و ارقام فقط',
            ],
        ],
        'emails'    => [
            'admins'    => [
                'header'        => 'لديك طلب جديد',
                'open_order'    => 'عرض الطلب',
                'subject'       => 'تم تلقي طلب جديد',
            ],
            'users'     => [
                'thanks_for_using' => 'شكرا لإستخدامك',
                'header'    => 'هذه فاتورة مشترياتك الأخيرة.',
            ],
            'vendors'   => [
                'header'        => 'لديك طلب جديد',
                'open_order'    => 'عرض الطلب',
                'subject'       => 'تم تلقي طلب جديد',
            ],
            'hi_dear' => 'مرحبا',
        ],
        'open_location' => "من فضلك قم بتفعيل احداثيات الجهاز.",
    ],
];
